app/Controllers/Home.php

SELECT *
FROM `userdata`
SELECT COUNT(*) AS `numrows` FROM `userdata`
---
    public function index()
    {
        $job = $this->jobModel->findAll();
        $jumlah_baris = $this->jobModel->countAll(); // Menghitung jumlah baris pada tabel

        $userdata = $this->userdataModel->findAll();
        $jumlah_baris2 = $this->userdataModel->countAll();