app/Controllers/Register.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Halo', 'halo@gmail.com', '6512bd43d9caa6e02c990b0a82652dca')
---
    public function create()
    {
        $data = [
            "name" => $this->request->getPost('name'),
            "email" => $this->request->getPost('email'),
            "password" => md5($this->request->getPost('password')),
        ];

        $this->userModel->insert($data);