app/Controllers/UserData.php

	public function index()
	{
		$userdata = $this->userdataModel->paginate(2, 'userdata');
---
SELECT *
FROM `userdata`
 LIMIT 4, 2
SELECT COUNT(*) AS `numrows`
FROM `userdata`

		$userdata = $this->userdataModel;
		$dataUser = $this->request->getFile('file');
		$fileName = $dataUser->getRandomName();
		$userdata->insert([
			'name' => $this->request->getPost('name'),
			'address' => $this->request->getPost('address'),
			'file' => $fileName,
			'position' => $this->request->getPost('position')
		]);
---
INSERT INTO `userdata` (`name`, `address`, `file`, `position`, `created_at`, `updated_at`) VALUES ('Rozha Purnama P', 'Jagakarsa', '1684390208_d3480ab6f2db23e50df2.pdf', 'Marketing', '2023-05-18 06:10:08', '2023-05-18 06:10:08')